Data/Section 5/5.2/Client/VM2_Instance1/rep2/output_C2_T1_W64_K6_R2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       37847 ops,     317 (avg:     420) ops/sec, 1.13MB/sec (avg: 1.50MB/sec),  6.25 (avg:  4.74) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         210.26          ---          ---      4.78200       218.35
Gets         210.25      1261.49         0.00      4.70000      1312.55
Waits          0.00          ---          ---      0.00000          ---
Totals       420.51      1261.49         0.00      4.74100      1530.90


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.800         0.02
SET       1.900         0.18
SET       2.000         0.74
SET       2.100         2.13
SET       2.200         4.59
SET       2.300         7.70
SET       2.400        11.55
SET       2.500        15.63
SET       2.600        19.71
SET       2.700        23.54
SET       2.800        26.99
SET       2.900        30.15
SET       3.000        33.05
SET       3.100        35.44
SET       3.200        37.68
SET       3.300        39.61
SET       3.400        41.67
SET       3.500        43.39
SET       3.600        44.93
SET       3.700        46.31
SET       3.800        47.53
SET       3.900        48.87
SET       4.000        50.03
SET       4.100        51.17
SET       4.200        52.30
SET       4.300        53.56
SET       4.400        54.61
SET       4.500        55.63
SET       4.600        56.80
SET       4.700        57.90
SET       4.800        59.17
SET       4.900        60.25
SET       5.000        61.28
SET       5.100        62.24
SET       5.200        63.39
SET       5.300        64.64
SET       5.400        65.76
SET       5.500        66.85
SET       5.600        68.03
SET       5.700        69.29
SET       5.800        70.57
SET       5.900        71.99
SET       6.000        73.43
SET       6.100        74.78
SET       6.200        76.24
SET       6.300        77.63
SET       6.400        79.21
SET       6.500        80.52
SET       6.600        81.73
SET       6.700        83.00
SET       6.800        84.25
SET       6.900        85.18
SET       7.000        86.16
SET       7.100        87.00
SET       7.200        87.77
SET       7.300        88.48
SET       7.400        89.17
SET       7.500        89.74
SET       7.600        90.27
SET       7.700        90.78
SET       7.800        91.27
SET       7.900        91.67
SET       8.000        92.02
SET       8.100        92.39
SET       8.200        92.63
SET       8.300        92.90
SET       8.400        93.14
SET       8.500        93.41
SET       8.600        93.71
SET       8.700        93.90
SET       8.800        94.12
SET       8.900        94.36
SET       9.000        94.63
SET       9.100        94.82
SET       9.200        95.14
SET       9.300        95.32
SET       9.400        95.60
SET       9.500        95.81
SET       9.600        96.01
SET       9.700        96.21
SET       9.800        96.40
SET       9.900        96.58
SET      10.000        97.37
SET      11.000        98.16
SET      12.000        98.55
SET      13.000        98.78
SET      14.000        99.06
SET      15.000        99.27
SET      16.000        99.38
SET      17.000        99.46
SET      18.000        99.55
SET      19.000        99.60
SET      20.000        99.68
SET      21.000        99.74
SET      22.000        99.78
SET      23.000        99.80
SET      24.000        99.83
SET      25.000        99.85
SET      26.000        99.86
SET      27.000        99.88
SET      28.000        99.90
SET      29.000        99.90
SET      30.000        99.91
SET      31.000        99.92
SET      32.000        99.93
SET      34.000        99.95
SET      36.000        99.96
SET      40.000        99.96
SET      41.000        99.97
SET      43.000        99.98
SET      44.000        99.98
SET      69.000        99.99
SET      70.000       100.00
---
GET       2.000         0.03
GET       2.100         0.21
GET       2.200         0.70
GET       2.300         2.15
GET       2.400         4.57
GET       2.500         7.94
GET       2.600        12.17
GET       2.700        16.90
GET       2.800        21.78
GET       2.900        26.15
GET       3.000        30.06
GET       3.100        33.81
GET       3.200        36.79
GET       3.300        39.75
GET       3.400        42.34
GET       3.500        44.56
GET       3.600        46.82
GET       3.700        48.66
GET       3.800        50.10
GET       3.900        51.65
GET       4.000        53.06
GET       4.100        54.34
GET       4.200        55.40
GET       4.300        56.50
GET       4.400        57.64
GET       4.500        58.69
GET       4.600        59.83
GET       4.700        60.90
GET       4.800        61.98
GET       4.900        63.11
GET       5.000        64.22
GET       5.100        65.24
GET       5.200        66.24
GET       5.300        67.27
GET       5.400        68.29
GET       5.500        69.41
GET       5.600        70.44
GET       5.700        71.76
GET       5.800        73.02
GET       5.900        74.11
GET       6.000        75.33
GET       6.100        76.58
GET       6.200        77.85
GET       6.300        79.16
GET       6.400        80.62
GET       6.500        81.98
GET       6.600        83.33
GET       6.700        84.52
GET       6.800        85.58
GET       6.900        86.57
GET       7.000        87.61
GET       7.100        88.57
GET       7.200        89.34
GET       7.300        90.13
GET       7.400        90.72
GET       7.500        91.31
GET       7.600        91.82
GET       7.700        92.32
GET       7.800        92.74
GET       7.900        93.08
GET       8.000        93.46
GET       8.100        93.71
GET       8.200        93.94
GET       8.300        94.25
GET       8.400        94.49
GET       8.500        94.70
GET       8.600        94.88
GET       8.700        95.01
GET       8.800        95.27
GET       8.900        95.44
GET       9.000        95.61
GET       9.100        95.76
GET       9.200        95.96
GET       9.300        96.14
GET       9.400        96.27
GET       9.500        96.41
GET       9.600        96.58
GET       9.700        96.72
GET       9.800        96.91
GET       9.900        97.07
GET      10.000        97.85
GET      11.000        98.61
GET      12.000        98.94
GET      13.000        99.12
GET      14.000        99.22
GET      15.000        99.38
GET      16.000        99.51
GET      17.000        99.57
GET      18.000        99.63
GET      19.000        99.69
GET      20.000        99.71
GET      21.000        99.75
GET      22.000        99.78
GET      23.000        99.79
GET      24.000        99.83
GET      25.000        99.84
GET      26.000        99.86
GET      28.000        99.88
GET      29.000        99.89
GET      30.000        99.92
GET      31.000        99.92
GET      32.000        99.93
GET      34.000        99.93
GET      36.000        99.94
GET      37.000        99.95
GET      38.000        99.96
GET      39.000        99.96
GET      41.000        99.97
GET      42.000        99.97
GET      50.000        99.98
GET      51.000        99.98
GET      71.000        99.99
GET      77.000        99.99
GET      83.000       100.00
---